index.org

#+TITLE: org pages
#+AUTHOR: Micky Ching
#+OPTIONS: H:4 ^:nil toc:t
#+LATEX_CLASS: latex-doc

* tools (1)
- [[file:tools/2014-10-05-website-navigation.html][2014-10-05 website navigation]]
* programming (3)
- [[file:programming/2014-10-04-emacs-org-mode.html][2014-10-04 emacs org mode]]
- [[file:programming/2014-10-03-emacs-magit.html][2014-10-03 emacs magit]]
- [[file:programming/2014-09-20-emacs-configuration.html][2014-09-20 emacs configuration]]
* slides (1)
- [[file:slides/2014-09-20-linux-kernel-coding-style.html][2014-09-20 linux kernel coding style]]
* linux (6)
- [[file:linux/2014-10-05-ubuntu-install-guide.html][2014-10-05 ubuntu install guide]]
- [[file:linux/2014-10-05-repo-introduction.html][2014-10-05 repo introduction]]
- [[file:linux/2014-10-03-publish-org.html][2014-10-03 publish org]]
- [[file:linux/2014-10-02-git-introduction.html][2014-10-02 git introduction]]
- [[file:linux/2014-09-24-fio-introduction.html][2014-09-24 fio introduction]]
- [[file:linux/2014-09-22-rhel-install-guide.html][2014-09-22 rhel install guide]]
* kernel (4)
- [[file:kernel/2014-10-02-linux-kernel-object.html][2014-10-02 linux kernel object]]
- [[file:kernel/2014-09-27-linux-kernel-list.html][2014-09-27 linux kernel list]]
- [[file:kernel/2014-09-26-mdev-introduction.html][2014-09-26 mdev introduction]]
- [[file:kernel/2014-09-25-block-events-introduction.html][2014-09-25 block events introduction]]
