index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>org pages</title>
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Micky Ching" />
<link rel="stylesheet" type="text/css" href="style/default.css" />


</head>
<body>
<div id="content">
<h1 class="title">org pages</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. programming (3)</a></li>
<li><a href="#sec-2">2. slides (1)</a></li>
<li><a href="#sec-3">3. linux (6)</a></li>
<li><a href="#sec-4">4. kernel (4)</a></li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> programming (3)</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li><a href="programming/2014-10-04-emacs-org-mode.html">2014-10-04 emacs org mode</a>
</li>
<li><a href="programming/2014-10-03-emacs-magit.html">2014-10-03 emacs magit</a>
</li>
<li><a href="programming/2014-09-20-emacs-configuration.html">2014-09-20 emacs configuration</a>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> slides (1)</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li><a href="slides/2014-09-20-linux-kernel-coding-style.html">2014-09-20 linux kernel coding style</a>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> linux (6)</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li><a href="linux/2014-10-05-ubuntu-install-guide.html">2014-10-05 ubuntu install guide</a>
</li>
<li><a href="linux/2014-10-05-repo-introduction.html">2014-10-05 repo introduction</a>
</li>
<li><a href="linux/2014-10-03-publish-org.html">2014-10-03 publish org</a>
</li>
<li><a href="linux/2014-10-02-git-introduction.html">2014-10-02 git introduction</a>
</li>
<li><a href="linux/2014-09-24-fio-introduction.html">2014-09-24 fio introduction</a>
</li>
<li><a href="linux/2014-09-22-rhel-install-guide.html">2014-09-22 rhel install guide</a>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> kernel (4)</h2>
<div class="outline-text-2" id="text-4">
<ul class="org-ul">
<li><a href="kernel/2014-10-02-linux-kernel-object.html">2014-10-02 linux kernel object</a>
</li>
<li><a href="kernel/2014-09-27-linux-kernel-list.html">2014-09-27 linux kernel list</a>
</li>
<li><a href="kernel/2014-09-26-mdev-introduction.html">2014-09-26 mdev introduction</a>
</li>
<li><a href="kernel/2014-09-25-block-events-introduction.html">2014-09-25 block events introduction</a>
</li>
</ul>
</div>
</div>
</div>
</body>
</html>
